{"items":[{"title":"Spyic - 875,999 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Spyic","pubDate":"Thu, 20 Feb 2025 23:12:38 Z","content":"In February 2025, the spyware service <a href=\"https://techcrunch.com/2025/02/20/stalkerware-apps-cocospy-spyic-exposing-phone-data-of-millions-of-people/\" target=\"_blank\" rel=\"noopener\">Spyic suffered a data breach along with sibling spywa [...]","contentSnippet":"In February 2025, the spyware service Spyic suffered a data breach along with sibling spyware service, Cocospy. The Spyic breach alone exposed almost 876k customer email addresses which were provided to HIBP, and reportedly also enabled unauthorised access to captured messages, photos, call logs, and more. The data was provided to HIBP by a source who requested it be attributed to \"zathienaephi@proton.me\".","guid":"Spyic","isoDate":"2025-02-20T23:12:38.000Z","tag":"hackcidents"},{"title":"Cocospy - 1,798,059 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Cocospy","pubDate":"Thu, 20 Feb 2025 22:36:16 Z","content":"In February 2025, the spyware service <a href=\"https://techcrunch.com/2025/02/20/stalkerware-apps-cocospy-spyic-exposing-phone-data-of-millions-of-people/\" target=\"_blank\" rel=\"noopener\">Cocospy suffered a data breach along with sibling spy [...]","contentSnippet":"In February 2025, the spyware service Cocospy suffered a data breach along with sibling spyware service, Spyic. The Cocospy breach alone exposed almost 1.8M customer email addresses which were provided to HIBP, and reportedly also enabled unauthorised access to captured messages, photos, call logs, and more. The data was provided to HIBP by a source who requested it be attributed to \"zathienaephi@proton.me\".","guid":"Cocospy","isoDate":"2025-02-20T22:36:16.000Z","tag":"hackcidents"},{"title":"Storenvy - 11,052,071 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Storenvy","pubDate":"Sun, 16 Feb 2025 08:31:34 Z","content":"In mid-2019, <a href=\"https://hackread.com/e-commerce-firm-storenvy-hacked-accounts-leaked/\" target=\"_blank\" rel=\"noopener\">the e-commerce website Storenvy suffered a data breach that exposed millions of customer records</a>. A portion of t [...]","contentSnippet":"In mid-2019, the e-commerce website Storenvy suffered a data breach that exposed millions of customer records. A portion of the breached records were subsequently posted to a hacking forum with cracked password hashes, whilst the entire corpus of 23M rows was put up for sale. The data contained 11M unique email addresses alongside usernames, IP addresses, the user's city, gender date of birth and original salted SHA-1 password hash.","guid":"Storenvy","isoDate":"2025-02-16T08:31:34.000Z","tag":"hackcidents"},{"title":"Doxbin (TOoDA) - 136,461 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#DoxbinTOoDA","pubDate":"Thu, 13 Feb 2025 07:18:47 Z","content":"In February 2025, <a href=\"https://x.com/vxunderground/status/1889487191283474872\" target=\"_blank\" rel=\"noopener\">the &quot;doxing&quot; website Doxbin was compromised by a group calling themselves &quot;TOoDA&quot; and the data dumped publ [...]","contentSnippet":"In February 2025, the \"doxing\" website Doxbin was compromised by a group calling themselves \"TOoDA\" and the data dumped publicly. Included in the breach were 336k unique email addresses alongside usernames. The data was provided to HIBP by a source who requested it be attributed to \"emo.rip\".","guid":"DoxbinTOoDA","isoDate":"2025-02-13T07:18:47.000Z","tag":"hackcidents"},{"title":"Zacks (2024) - 11,994,223 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Zacks2024","pubDate":"Wed, 12 Feb 2025 23:19:43 Z","content":"In June 2024, <a href=\"https://darkwebinformer.com/a-threat-actor-claims-to-have-leaked-the-data-of-zacks-investment-research/\" target=\"_blank\" rel=\"noopener\">the investment research company Zacks was allegedly breached, and data was later  [...]","contentSnippet":"In June 2024, the investment research company Zacks was allegedly breached, and data was later published to a popular hacking forum. This comes after a separate Zacks data breach confirmed by the organisation in 2023 with the subsequent breach disclosing millions of additional records representing a superset of data from the first incident. The 2024 breach included 12M unique email addresses along with IP and physical addresses, names, usernames, phone numbers and unsalted SHA-256 password hashes. Zacks did not respond to multiple attempts to contact them about the incident.","guid":"Zacks2024","isoDate":"2025-02-12T23:19:43.000Z","tag":"hackcidents"},{"title":"LandAirSea - 337,373 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#LandAirSea","pubDate":"Tue, 11 Feb 2025 02:35:40 Z","content":"In January 2025, the GPS tracking service LandAirSea suffered a data breach that exposed 337k unique customer email addresses alongside names, usernames and password hashes. The breach also exposed partial credit card data (card type, last  [...]","contentSnippet":"In January 2025, the GPS tracking service LandAirSea suffered a data breach that exposed 337k unique customer email addresses alongside names, usernames and password hashes. The breach also exposed partial credit card data (card type, last 4 digits and expiration), and GPS device identifiers and locations. LandAirSea is aware of the breach and has remediated the underlying vulnerability. The data was provided to HIBP by a source who requested it be attributed to \"zathienaephi@proton.me\".","guid":"LandAirSea","isoDate":"2025-02-11T02:35:40.000Z","tag":"hackcidents"},{"title":"Adopt Me Trading Values - 86,136 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#AdoptMeTradingValues","pubDate":"Mon, 10 Feb 2025 02:58:18 Z","content":"In July 2022, the Adopt Me Trading Values website for assessing the value of pet trades within the &quot;Adopt Me!&quot; Roblox game suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother [...]","contentSnippet":"In July 2022, the Adopt Me Trading Values website for assessing the value of pet trades within the \"Adopt Me!\" Roblox game suffered a data breach that was later redistributed as part of a larger corpus of data. The breach exposed 86k unique email addresses along with usernames (and Roblox usernames), IP addresses and bcrypt password hashes. The data was provided to HIBP by a source who requested it be attributed to \"Leidhall\".","guid":"AdoptMeTradingValues","isoDate":"2025-02-10T02:58:18.000Z","tag":"hackcidents"},{"title":"Youthmanual - 937,912 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Youthmanual","pubDate":"Sun, 09 Feb 2025 06:28:46 Z","content":"In January 2019, the Indonesian college and career platform <a href=\"https://thehackernews.com/2019/03/data-breach-security.html\" target=\"_blank\" rel=\"noopener\">Youthmanual suffered a data breach that exposed 1.1M records of data</a>. The b [...]","contentSnippet":"In January 2019, the Indonesian college and career platform Youthmanual suffered a data breach that exposed 1.1M records of data. The breached included 938k unique email addresses along with extensive personal information including names, genders, dates and places of birth, phone numbers, physical addresses and salted SHA-1 password hashes.","guid":"Youthmanual","isoDate":"2025-02-09T06:28:46.000Z","tag":"hackcidents"},{"title":"Thermomix Recipe World Forum - 3,123,439 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Thermomix","pubDate":"Thu, 06 Feb 2025 20:20:40 Z","content":"In January 2025, <a href=\"https://www.presseportal.de/pm/52621/5965724\" target=\"_blank\" rel=\"noopener\">the Rezeptwelt (German for &quot;recipe world&quot;) forum for Thermomix owners suffered a data breach</a>. The incident exposed 3.1M reg [...]","contentSnippet":"In January 2025, the Rezeptwelt (German for \"recipe world\") forum for Thermomix owners suffered a data breach. The incident exposed 3.1M registered users' details including names, email and physical addresses, phone numbers, dates of birth and bios (usually cooking related). The data was provided to HIBP by a source who requested it be attributed to \"ayame@xmpp.jp\".","guid":"Thermomix","isoDate":"2025-02-06T20:20:40.000Z","tag":"hackcidents"},{"title":"Hakko Corporation - 9,665 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Hakko","pubDate":"Thu, 06 Feb 2025 01:58:47 Z","content":"In March 2019, <a href=\"https://upfsecurity.co.jp/pmark/8395/\" target=\"_blank\" rel=\"noopener\">the Japanese solder-related business Hakko Corporation suffered a data breach</a>. The incident exposed almost 10k customer records including emai [...]","contentSnippet":"In March 2019, the Japanese solder-related business Hakko Corporation suffered a data breach. The incident exposed almost 10k customer records including email and physical addresses, phone numbers, names, usernames, genders, dates of birth and plain text passwords.","guid":"Hakko","isoDate":"2025-02-06T01:58:47.000Z","tag":"hackcidents"},{"title":"PoinCampus - 89,116 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#PoinCampus","pubDate":"Tue, 04 Feb 2025 00:29:41 Z","content":"In November 2024, <a href=\"https://darkwebinformer.com/888-has-allegedly-leaked-the-data-of-poincampus/\" target=\"_blank\" rel=\"noopener\">the South Korean education platform PoinCampus suffered a data breach which was later published to a pop [...]","contentSnippet":"In November 2024, the South Korean education platform PoinCampus suffered a data breach which was later published to a popular hacking forum. The data included 89k unique email addresses, names and a small number of phone numbers and dates of birth. The data was provided to HIBP by a source who requested it be attributed to \"Threat Actor 888\".","guid":"PoinCampus","isoDate":"2025-02-04T00:29:41.000Z","tag":"hackcidents"},{"title":"1win - 96,166,543 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#1win","pubDate":"Mon, 03 Feb 2025 17:37:55 Z","content":"In November 2024, <a href=\"https://cryptoadventure.com/1win-hack-leaks-data-of-100-million-users-can-gamblefi-save-the-day/\" target=\"_blank\" rel=\"noopener\">the online betting platform 1win suffered a data breach that exposed 96M users</a>.  [...]","contentSnippet":"In November 2024, the online betting platform 1win suffered a data breach that exposed 96M users. The exposed data included email and IP addresses, phone numbers, dates of birth, country and SHA-256 password hashes. The data was provided to HIBP by a source who requested it be attributed to \"Leidhall\".","guid":"1win","isoDate":"2025-02-03T17:37:55.000Z","tag":"hackcidents"},{"title":"DragonNest - 511,290 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#DragonNest","pubDate":"Mon, 03 Feb 2025 04:29:37 Z","content":"In August 2013, the massively multiplayer online role-playing game (MMORGP) DragonNest suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/\" target=\"_blank\" rel=\"noopen [...]","contentSnippet":"In August 2013, the massively multiplayer online role-playing game (MMORGP) DragonNest suffered a data breach that was later redistributed as part of a larger corpus of data. The breach exposed over 500k unique email addresses along with usernames, IP addresses and plain text passwords. The service later suffered a massive data loss.","guid":"DragonNest","isoDate":"2025-02-03T04:29:37.000Z","tag":"hackcidents"},{"title":"9Lives - 109,515 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#9Lives","pubDate":"Sun, 02 Feb 2025 02:04:44 Z","content":"In October 2014, the (now defunct) Belgian gaming news forum 9Lives suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/\" target=\"_blank\" rel=\"noopener\">that was later  [...]","contentSnippet":"In October 2014, the (now defunct) Belgian gaming news forum 9Lives suffered a data breach that was later redistributed as part of a larger corpus of data. The breach exposed 109k unique email addresses along with usernames and salted MD5 password hashes. The data was provided to HIBP by a source who requested it be attributed to \"Leidhall\".","guid":"9Lives","isoDate":"2025-02-02T02:04:44.000Z","tag":"hackcidents"},{"title":"Speedio (unverified) - 27,501,041 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Speedio","pubDate":"Thu, 30 Jan 2025 07:14:40 Z","content":"In December 2024, <a href=\"https://darkwebinformer.com/a-threat-actor-is-allegedly-selling-the-data-of-speedio/\" target=\"_blank\" rel=\"noopener\">data alleged to have been taken from the Brazilian lead generation platform Speedio was posted f [...]","contentSnippet":"In December 2024, data alleged to have been taken from the Brazilian lead generation platform Speedio was posted for sale to a popular hacking forum. The data was allegedly obtained from an unsecured Elasticsearch instance and contained over 62M records of largely public business information including company names, phone numbers and physical addresses, along with 27M unique email addresses, predominantly from public services such as Gmail and Outlook. Speedio did not respond to multiple attempts to disclose the incident, and the origin of the data could not be independently verified. The data was provided to HIBP by a source who requested it be attributed to \"ayame@xmpp.jp\".","guid":"Speedio","isoDate":"2025-01-30T07:14:40.000Z","tag":"hackcidents"},{"title":"HeatGames - 647,896 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#HeatGames","pubDate":"Tue, 28 Jan 2025 07:40:43 Z","content":"In June 2021, the (now defunct) gaming website HeatGames suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/\" target=\"_blank\" rel=\"noopener\">that was later redistribut [...]","contentSnippet":"In June 2021, the (now defunct) gaming website HeatGames suffered a data breach that was later redistributed as part of a larger corpus of data. The breach exposed almost 650k unique email addresses along with IP addresses, country and salted MD5 password hashes.","guid":"HeatGames","isoDate":"2025-01-28T07:40:43.000Z","tag":"hackcidents"},{"title":"Doxbin Scrape - 435,784 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#DoxbinScrape","pubDate":"Tue, 28 Jan 2025 02:09:58 Z","content":"In January 2025, <a href=\"https://medium.com/@zuajes/public-statement-on-the-extraction-of-emails-from-doxbin-cfd036c07a24\" target=\"_blank\" rel=\"noopener\">435k email addresses were scraped from the &quot;doxing&quot; service Doxbin</a>. Pos [...]","contentSnippet":"In January 2025, 435k email addresses were scraped from the \"doxing\" service Doxbin. Posts to the service are usually intended to disclose the personal information of non-consensually third parties. The data was provided to HIBP by a source who requested it be attributed to \"oathnet.ru\".","guid":"DoxbinScrape","isoDate":"2025-01-28T02:09:58.000Z","tag":"hackcidents"},{"title":"Frame & Optic - 15,678 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#FrameAndOptic","pubDate":"Wed, 22 Jan 2025 08:46:16 Z","content":"In January 2025, <a href=\"https://dailydarkweb.net/eyewear-wholesaler-data-breach-sparks-privacy-concerns/\" target=\"_blank\" rel=\"noopener\">the eyewear seller Frame & Optic suffered a data breach</a>. The incident exposed almost 16k unique e [...]","contentSnippet":"In January 2025, the eyewear seller Frame & Optic suffered a data breach. The incident exposed almost 16k unique email addresses along with names, phone numbers and geolocation data including country, state and postcode. The data was provided to HIBP by a source who requested it be attributed to \"oathnet.ru\".","guid":"FrameAndOptic","isoDate":"2025-01-22T08:46:16.000Z","tag":"hackcidents"},{"title":"Welhof - 107,292 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Welhof","pubDate":"Wed, 22 Jan 2025 08:28:11 Z","content":"In late 2023, <a href=\"https://www.welhof.com/nl_nl/klantenservice/welhof-cyberbeveiligingsincident\" target=\"_blank\" rel=\"noopener\">the Dutch appliance store Welhof suffered a data breach</a>. The incident exposed over 100k unique email add [...]","contentSnippet":"In late 2023, the Dutch appliance store Welhof suffered a data breach. The incident exposed over 100k unique email addresses along with names, physical addresses and the value of purchases made. The data was provided to HIBP by a source who requested it be attributed to \"oathnet.ru\".","guid":"Welhof","isoDate":"2025-01-22T08:28:11.000Z","tag":"hackcidents"},{"title":"Otelier - 436,855 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Otelier","pubDate":"Sat, 18 Jan 2025 06:47:39 Z","content":"In July 2024, <a href=\"https://www.bleepingcomputer.com/news/security/otelier-data-breach-exposes-info-hotel-reservations-of-millions/\" target=\"_blank\" rel=\"noopener\">a threat actor gained access to the hotel management platform Otelier and [...]","contentSnippet":"In July 2024, a threat actor gained access to the hotel management platform Otelier and retrieved customer data from well-known hotel brands including Marriott, Hilton, and Hyatt. The data included 437k customer email addresses (a further 868k generated email addresses from the booking.com and Expedia platforms were not loaded into HIBP), names, physical addresses, phone numbers, booking information related to travel plans, purchases recorded by the platform and in a small number of cases, partial credit card data. The data was provided to HIBP by a source who requested it be attributed to \"ayame@xmpp.jp\".","guid":"Otelier","isoDate":"2025-01-18T06:47:39.000Z","tag":"hackcidents"},{"title":"MSI - 249,990 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#MSI","pubDate":"Fri, 17 Jan 2025 01:14:17 Z","content":"In July 2024, <a href=\"https://www.youtube.com/watch?v=DeE_gLl3j94\" target=\"_blank\" rel=\"noopener\">MSI inadvertently exposed hundreds of thousands of customer records related to RMA claims that were subsequently found to be publicly accessi [...]","contentSnippet":"In July 2024, MSI inadvertently exposed hundreds of thousands of customer records related to RMA claims that were subsequently found to be publicly accessible. The data included 250k unique email addresses alongside names, phone numbers, physical addresses and warranty claims. When contacted about the incident, MSI advised that \"there is no evidence the information was ever accessed\" and that \"the security incident we had did not trigger state data breach notification obligations\" due to the absence of \"(social security number, driver's license number….etc)\".","guid":"MSI","isoDate":"2025-01-17T01:14:17.000Z","tag":"hackcidents"},{"title":"Le Coq Sportif Columbia - 79,712 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#LeCoqSportif","pubDate":"Thu, 16 Jan 2025 01:40:33 Z","content":"In January 2025, <a href=\"https://dailydarkweb.net/colombia-data-breach-reported-at-lecoqsportif-com-co/\" target=\"_blank\" rel=\"noopener\">a data breach from the Columbian website for Le Coq Sportif was posted to a popular hacking forum</a>.  [...]","contentSnippet":"In January 2025, a data breach from the Columbian website for Le Coq Sportif was posted to a popular hacking forum. The data included almost 80k unique email addresses with the breach dating back to May 2023. Impacted data included physical and IP addresses, names, purchases, genders, dates of birth and bcrypt password hashes. The data was provided to HIBP by a source who requested it be attributed to \"oathnet.ru\".","guid":"LeCoqSportif","isoDate":"2025-01-16T01:40:33.000Z","tag":"hackcidents"},{"title":"Stealer Logs, Jan 2025 - 71,039,833 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#StealerLogsJan2025","pubDate":"Mon, 13 Jan 2025 19:41:58 Z","content":"In January 2025, <a href=\"https://troyhunt.com/experimenting-with-stealer-logs-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">stealer logs with 71M email addresses were added to HIBP</a>. Consisting of email address, password and the [...]","contentSnippet":"In January 2025, stealer logs with 71M email addresses were added to HIBP. Consisting of email address, password and the website the credentials were entered against, this breach marks the launch of a new HIBP feature enabling the retrieval of the specific websites the logs were collected against. The incident also resulted in 106M more passwords being added to the Pwned Passwords service.","guid":"StealerLogsJan2025","isoDate":"2025-01-13T19:41:58.000Z","tag":"hackcidents"},{"title":"Scholastic - 4,247,768 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Scholastic","pubDate":"Mon, 13 Jan 2025 01:55:39 Z","content":"In January 2025, <a href=\"https://www.dailydot.com/debug/furry-hacks-scholastic-8-million-records-stolen/\" target=\"_blank\" rel=\"noopener\">a data breach of the publishing company Scholastic surfaced</a>. The breach contained 4.2M unique emai [...]","contentSnippet":"In January 2025, a data breach of the publishing company Scholastic surfaced. The breach contained 4.2M unique email addresses with many of the records also including name, phone number and physical address.","guid":"Scholastic","isoDate":"2025-01-13T01:55:39.000Z","tag":"hackcidents"},{"title":"SuperDraft - 300,187 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#SuperDraft","pubDate":"Sun, 12 Jan 2025 05:43:05 Z","content":"In October 2024, the fantasy sports platform <a href=\"https://x.com/troyhunt/status/1878316383303250120\" target=\"_blank\" rel=\"noopener\">SuperDraft suffered a data breach</a> that exposed over 300k customer records. The breach contained 24GB [...]","contentSnippet":"In October 2024, the fantasy sports platform SuperDraft suffered a data breach that exposed over 300k customer records. The breach contained 24GB of data including email addresses, usernames, purchases, latitudes and longitudes, dates of birth and bcrypt password hashes.","guid":"SuperDraft","isoDate":"2025-01-12T05:43:05.000Z","tag":"hackcidents"},{"title":"GLAMIRA - 874,594 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#GLAMIRA","pubDate":"Fri, 03 Jan 2025 07:55:22 Z","content":"In late 2023, the online jewellery store <a href=\"https://www.reddit.com/r/EngagementRings/comments/1adqinl/comment/koqzq4g/\" target=\"_blank\" rel=\"noopener\">GLAMIRA suffered a data breach they attributed to &quot;an unauthorised individual  [...]","contentSnippet":"In late 2023, the online jewellery store GLAMIRA suffered a data breach they attributed to \"an unauthorised individual [who] briefly accessed one of our servers\". The data was subsequently published on a popular hacking forum and included 875k email addresses, names, phone numbers and purchases. The data was provided to HIBP by a source who requested it be attributed to \"oathnet.ru\".","guid":"GLAMIRA","isoDate":"2025-01-03T07:55:22.000Z","tag":"hackcidents"},{"title":"French Citizens - 28,445,106 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#FrenchCitizens","pubDate":"Fri, 20 Dec 2024 09:54:50 Z","content":"In September 2024, <a href=\"https://cybernews.com/security/french-records-exposed-by-mysterious-data-hoarder/\" target=\"_blank\" rel=\"noopener\">over 90M rows of data on French Citizens was found left exposed in a publicly facing database</a>. [...]","contentSnippet":"In September 2024, over 90M rows of data on French Citizens was found left exposed in a publicly facing database. Compiled from various data breaches, the corpus contained 28M unique email addresses with the various source breaches each exposing different fields including name, physical and IP address, phone number and partial credit card data including payment type and last 4 digits.","guid":"FrenchCitizens","isoDate":"2024-12-20T09:54:50.000Z","tag":"hackcidents"},{"title":"Young Living Essential Oils - 1,128,951 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#YoungLivingEssentialOils","pubDate":"Thu, 19 Dec 2024 14:37:40 Z","content":"In December 2024, <a href=\"https://x.com/H4ckManac/status/1866937778057122203\" target=\"_blank\" rel=\"noopener\">data claimed to be breached from the multi-level marketing company Young Living Essential Oils was posted to a popular hacking for [...]","contentSnippet":"In December 2024, data claimed to be breached from the multi-level marketing company Young Living Essential Oils was posted to a popular hacking forum. The data contained 1.1M unique email addresses alongside names, the country of the account and in many cases, their date of birth. The data was provided to HIBP by a source who requested it be attributed to \"Threat Actor 888\". Young Living Essential Oils did not respond to multiple attempts to contact them about the data.","guid":"YoungLivingEssentialOils","isoDate":"2024-12-19T14:37:40.000Z","tag":"hackcidents"},{"title":"schenkYOU - 237,349 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#schenkYOU","pubDate":"Thu, 19 Dec 2024 13:26:26 Z","content":"In September 2024, <a href=\"https://dailydarkweb.net/alleged-data-breach-at-schenkyou-a-threat-actor-claims-to-sell-6-million-records-on-dark-web/\" target=\"_blank\" rel=\"noopener\">data from the online German gift store schenkYOU was put up f [...]","contentSnippet":"In September 2024, data from the online German gift store schenkYOU was put up for sale on a popular hacking forum. Obtained the month before, the data included 237k unique email addresses alongside names, dates of birth and salted SHA-256 password hashes. The standalone store was subsequently shut down with all traffic redirected to their Amazon store.","guid":"schenkYOU","isoDate":"2024-12-19T13:26:26.000Z","tag":"hackcidents"},{"title":"BitView - 63,127 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#BitView","pubDate":"Thu, 19 Dec 2024 07:46:30 Z","content":"In December 2024, <a href=\"https://www.bitview.net/blog#157\" target=\"_blank\" rel=\"noopener\">the video sharing Community BitView suffered a data breach that exposed 63k customer records</a>. Attributed to a backup taken by a previous adminis [...]","contentSnippet":"In December 2024, the video sharing Community BitView suffered a data breach that exposed 63k customer records. Attributed to a backup taken by a previous administrator earlier in the year, the breach exposed email and IP addresses, bcrypt password hashes, usernames, bios, private messages, video comments and for some records, gender, date of birth and country of location.","guid":"BitView","isoDate":"2024-12-19T07:46:30.000Z","tag":"hackcidents"},{"title":"Hopamedia - 23,835,870 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Hopamedia","pubDate":"Mon, 16 Dec 2024 13:23:36 Z","content":"In 2024, <a href=\"https://x.com/troyhunt/status/1868213788530630948\" target=\"_blank\" rel=\"noopener\">data relating to an unknown service referred to as &quot;Hopamedia&quot; and dating back to 2020 appeared in a publicly exposed database</a> [...]","contentSnippet":"In 2024, data relating to an unknown service referred to as \"Hopamedia\" and dating back to 2020 appeared in a publicly exposed database. The data included almost 24M records of email address, name, phone number, the country of the individual and their telecommunications carrier.","guid":"Hopamedia","isoDate":"2024-12-16T13:23:36.000Z","tag":"hackcidents"},{"title":"MC2 Data - 2,122,280 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#MC2Data","pubDate":"Sun, 15 Dec 2024 17:47:05 Z","content":"In August 2024, <a href=\"https://cybernews.com/security/us-mc2-background-check-data-leak/\" target=\"_blank\" rel=\"noopener\">data aggregator MC2 Data left a database publicly accessible without a password which was subsequently discovered by  [...]","contentSnippet":"In August 2024, data aggregator MC2 Data left a database publicly accessible without a password which was subsequently discovered by a security researcher. The breach exposed the personal information of 2.1M subscribers to the service which was marketed under a series of different brand names. The data included email addresses, names and salted SHA-256 password hashes.","guid":"MC2Data","isoDate":"2024-12-15T17:47:05.000Z","tag":"hackcidents"},{"title":"Yonéma - 35,962 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Yonema","pubDate":"Sat, 14 Dec 2024 07:28:27 Z","content":"In November 2024, <a href=\"https://x.com/cyberfeeddigest/status/1859676458588713010\" target=\"_blank\" rel=\"noopener\">data from the Senegalese payment platform Yonéma was posted to a popular hacking forum</a>. The data included 36k unique ema [...]","contentSnippet":"In November 2024, data from the Senegalese payment platform Yonéma was posted to a popular hacking forum. The data included 36k unique email addresses alongside phone numbers, names and what appears to be encrypted passwords and dates of birth.","guid":"Yonema","isoDate":"2024-12-14T07:28:27.000Z","tag":"hackcidents"},{"title":"Tibber - 50,002 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Tibber","pubDate":"Sat, 14 Dec 2024 06:49:41 Z","content":"In November 2024, <a href=\"https://www.heise.de/en/news/Electricity-provider-Tibber-hacked-50-000-German-customers-affected-10031690.html\" target=\"_blank\" rel=\"noopener\">the German electricity provider Tibber suffered a data breach that exp [...]","contentSnippet":"In November 2024, the German electricity provider Tibber suffered a data breach that exposed the personal information of 50k customers. The data included names, email addresses, geographic locations (city and postcode) and total spend on purchases. The data was provided to HIBP by a source who requested it be attributed to \"Threat Actor 888\".","guid":"Tibber","isoDate":"2024-12-14T06:49:41.000Z","tag":"hackcidents"},{"title":"Senior Dating - 765,517 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#SeniorDating","pubDate":"Mon, 09 Dec 2024 12:38:50 Z","content":"In 2024, <a href=\"https://x.com/RhinozzCode/status/1863745736245928351\" target=\"_blank\" rel=\"noopener\">the 40+ dating website Senior Dating suffered a data breach</a>. Attributed to an exposed Firebase database, the breach included extensiv [...]","contentSnippet":"In 2024, the 40+ dating website Senior Dating suffered a data breach. Attributed to an exposed Firebase database, the breach included extensive personal information on 766k users of the service including email addresses, photos, genders, links to Facebook accounts, dates of birth and precise latitude and longitude, among other personal attributes. The website was shut down after the breach was acknowledged by the site operator in December, along with a breach of the \"ladies.com\" website run by the same organisation.","guid":"SeniorDating","isoDate":"2024-12-09T12:38:50.000Z","tag":"hackcidents"},{"title":"Ladies.com - 118,809 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Ladies","pubDate":"Mon, 09 Dec 2024 11:45:16 Z","content":"In 2024, <a href=\"https://x.com/RhinozzCode/status/1863745736245928351\" target=\"_blank\" rel=\"noopener\">the lesbian dating website ladies.com suffered a data breach</a>. Attributed to an exposed Firebase database, the breach included extensi [...]","contentSnippet":"In 2024, the lesbian dating website ladies.com suffered a data breach. Attributed to an exposed Firebase database, the breach included extensive personal information on 119k users of the service including email addresses, photos, sexual orientation, genders, dates of birth and precise latitude and longitude, among other personal attributes. The website was shut down in mid-2024 and the breach later acknowledged by the site operator in December, along with a breach of the \"Senior Dating\" website run by the same organisation.","guid":"Ladies","isoDate":"2024-12-09T11:45:16.000Z","tag":"hackcidents"},{"title":"The Real World - 324,382 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#TheRealWorld","pubDate":"Fri, 22 Nov 2024 21:55:44 Z","content":"In November 2024, the online course founded by Andrew Tate known as &quot;The Real World&quot; (previously &quot;Hustler's University&quot; <a href=\"https://www.dailydot.com/debug/andrew-tate-the-real-world-hack/\" target=\"_blank\" rel=\"noope [...]","contentSnippet":"In November 2024, the online course founded by Andrew Tate known as \"The Real World\" (previously \"Hustler's University\" suffered a data breach that exposed almost 325k users of the platform. The impacted data was limited to usernames, email addresses and chat logs.","guid":"TheRealWorld","isoDate":"2024-11-22T21:55:44.000Z","tag":"hackcidents"},{"title":"FlipaClip - 892,854 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#FlipaClip","pubDate":"Wed, 20 Nov 2024 22:37:58 Z","content":"In November 2024, the animation app <a href=\"https://x.com/RhinozzCode/status/1859291987360321631\" target=\"_blank\" rel=\"noopener\">FlipaClip suffered a data breach that exposed almost 900k records due to an exposed Firebase server</a>. The i [...]","contentSnippet":"In November 2024, the animation app FlipaClip suffered a data breach that exposed almost 900k records due to an exposed Firebase server. The impacted data included name, email address, country and date of birth. FlipaClip advised the issue has since been rectified.","guid":"FlipaClip","isoDate":"2024-11-20T22:37:58.000Z","tag":"hackcidents"},{"title":"Finsure - 296,124 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Finsure","pubDate":"Tue, 19 Nov 2024 04:25:18 Z","content":"In October 2024, almost 300k unique email addresses from Australian mortgage broking group Finsure were obtained from the ActivePipe real estate marketing platform. The impacted data also included names, phone numbers and physical addresses [...]","contentSnippet":"In October 2024, almost 300k unique email addresses from Australian mortgage broking group Finsure were obtained from the ActivePipe real estate marketing platform. The impacted data also included names, phone numbers and physical addresses. The incident did not directly affect any of Finsure's systems or expose any passwords or financial data.","guid":"Finsure","isoDate":"2024-11-19T04:25:18.000Z","tag":"hackcidents"},{"title":"DemandScience by Pure Incubation - 121,796,165 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#DemandScience","pubDate":"Wed, 13 Nov 2024 09:53:35 Z","content":"In early 2024, <a href=\"https://www.troyhunt.com/inside-the-demandscience-by-pure-incubation-data-breach\" target=\"_blank\" rel=\"noopener\">a large corpus of data from DemandScience (a company owned by Pure Incubation), appeared for sale on a  [...]","contentSnippet":"In early 2024, a large corpus of data from DemandScience (a company owned by Pure Incubation), appeared for sale on a popular hacking forum. Later attributed to a leak from a decommissioned legacy system, the breach contained extensive data that was largely business contact information aggregated from public sources. Specifically, the data included 122M unique corporate email addresses, physical addresses, phone numbers, employers and job titles. It also included names and for many individuals, a link to their LinkedIn profile.","guid":"DemandScience","isoDate":"2024-11-13T09:53:35.000Z","tag":"hackcidents"},{"title":"Hot Topic - 56,904,909 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#HotTopic","pubDate":"Mon, 11 Nov 2024 07:50:58 Z","content":"In October 2024, <a href=\"https://au.pcmag.com/security/107921/hacker-may-have-breached-hot-topic-stolen-data-on-millions\" target=\"_blank\" rel=\"noopener\">retailer Hot Topic suffered a data breach that exposed 57 million unique email address [...]","contentSnippet":"In October 2024, retailer Hot Topic suffered a data breach that exposed 57 million unique email addresses. The impacted data also included physical addresses, phone numbers, purchases, genders, dates of birth and partial credit data containing card type, expiry and last 4 digits.","guid":"HotTopic","isoDate":"2024-11-11T07:50:58.000Z","tag":"hackcidents"},{"title":"Earth 2 - 420,961 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Earth2","pubDate":"Thu, 07 Nov 2024 04:49:02 Z","content":"In October 2024, 421k unique email addresses from the virtual earth game Earth 2 were derived from embedded Gravatar images. Appearing alongside player usernames, the root cause was related to how Gravatar presents links to avatars as MD5 h [...]","contentSnippet":"In October 2024, 421k unique email addresses from the virtual earth game Earth 2 were derived from embedded Gravatar images. Appearing alongside player usernames, the root cause was related to how Gravatar presents links to avatars as MD5 hashes within consuming services, a feature Earth 2 advised has now been disabled on their platform. This incident did not expose any further personal information, passwords or financial data.","guid":"Earth2","isoDate":"2024-11-07T04:49:02.000Z","tag":"hackcidents"},{"title":"Dennis Kirk - 1,356,026 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#DennisKirk","pubDate":"Tue, 05 Nov 2024 22:11:58 Z","content":"In October 2024, almost 20GB of data containing 1.3M unique email addresses from motorcycle supplies store Dennis Kirk was circulated. Dating back to September 2021, the data also contained purchases from the online store along with custome [...]","contentSnippet":"In October 2024, almost 20GB of data containing 1.3M unique email addresses from motorcycle supplies store Dennis Kirk was circulated. Dating back to September 2021, the data also contained purchases from the online store along with customer names, phone numbers and postcodes. Dennis Kirk did not respond to multiple attempts to make contact about the breach. The data was provided to HIBP by a source who requested it be attributed to \"IntelBroker, almighty444 & EnergyWeaponUser\".","guid":"DennisKirk","isoDate":"2024-11-05T22:11:58.000Z","tag":"hackcidents"},{"title":"Altenen - 1,267,701 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#Altenen","pubDate":"Tue, 05 Nov 2024 06:20:27 Z","content":"In June 2022, the malicious &quot;carding&quot; (referring to credit card fraud) website Altenen suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/\" target=\"_blank\" r [...]","contentSnippet":"In June 2022, the malicious \"carding\" (referring to credit card fraud) website Altenen suffered a data breach that was later redistributed as part of a larger corpus of data. The data included 1.3M unique email addresses, usernames, bcrypt password hashes and cryptocurrency wallet addresses.","guid":"Altenen","isoDate":"2024-11-05T06:20:27.000Z","tag":"hackcidents"},{"title":"Z-lib - 9,737,374 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#ZLib","pubDate":"Mon, 04 Nov 2024 04:12:07 Z","content":"In June 2024, <a href=\"https://cybernews.com/security/zlibrary-copycat-exposes-millions-digital-pirates/\" target=\"_blank\" rel=\"noopener\">almost 10M user records from Z-lib were discovered exposed online</a>. Now defunct, Z-lib was a malicio [...]","contentSnippet":"In June 2024, almost 10M user records from Z-lib were discovered exposed online. Now defunct, Z-lib was a malicious clone of Z-Library, a well-known shadow online platform for pirating books and academic papers. The exposed data included usernames, email addresses, countries of residence, Bitcoin and Monero cryptocurrency wallet addresses, purchases and bcrypt password hashes.","guid":"ZLib","isoDate":"2024-11-04T04:12:07.000Z","tag":"hackcidents"},{"title":"Stalker Online - 1,385,472 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#StalkerOnline","pubDate":"Thu, 31 Oct 2024 20:11:33 Z","content":"In May 2020, <a href=\"https://www.bitdefender.com/en-gb/blog/hotforsecurity/data-breach-hacker-sells-over-1-3-million-user-records-of-popular-stalker-online-mmo-game-on-dark-web-marketplace/\" target=\"_blank\" rel=\"noopener\">over 1.3M records [...]","contentSnippet":"In May 2020, over 1.3M records from the MMO game Stalker Online were breached. The data included email and IP addresses, usernames and hashed passwords.","guid":"StalkerOnline","isoDate":"2024-10-31T20:11:33.000Z","tag":"hackcidents"},{"title":"TNAFlix - 1,374,344 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#TNAFlix","pubDate":"Wed, 30 Oct 2024 23:01:03 Z","content":"In June 2022, the adult website TNAFlix suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/\" target=\"_blank\" rel=\"noopener\">that was later redistributed as part of a l [...]","contentSnippet":"In June 2022, the adult website TNAFlix suffered a data breach that was later redistributed as part of a larger corpus of data. The data included 1.4M records of email and IP addresses, usernames and plain text passwords.","guid":"TNAFlix","isoDate":"2024-10-30T23:01:03.000Z","tag":"hackcidents"},{"title":"VimeWorld - 3,118,964 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#VimeWorld","pubDate":"Wed, 30 Oct 2024 07:02:43 Z","content":"In October 2018, the Russian Minecraft service VimeWorld suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/\" target=\"_blank\" rel=\"noopener\">that was later redistribut [...]","contentSnippet":"In October 2018, the Russian Minecraft service VimeWorld suffered a data breach that was later redistributed as part of a larger corpus of data. The data included 3.1M records of usernames, email and IP addresses and passwords stored as either MD5 or bcrypt hashes.","guid":"VimeWorld","isoDate":"2024-10-30T07:02:43.000Z","tag":"hackcidents"},{"title":"StreamCraft - 1,772,620 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#StreamCraft","pubDate":"Sun, 27 Oct 2024 21:01:08 Z","content":"In July 2020, the Russian Minecraft service StreamCraft suffered a data breach <a href=\"https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/\" target=\"_blank\" rel=\"noopener\">that was later redistribute [...]","contentSnippet":"In July 2020, the Russian Minecraft service StreamCraft suffered a data breach that was later redistributed as part of a larger corpus of data. The data included 1.8M records of usernames, email and IP addresses and passwords stored as either MD5 or bcrypt hashes.","guid":"StreamCraft","isoDate":"2024-10-27T21:01:08.000Z","tag":"hackcidents"},{"title":"The Club Penguin Experience - 6,342 breached accounts","link":"https://haveibeenpwned.com/PwnedWebsites#TheClubPenguinExperience","pubDate":"Sat, 26 Oct 2024 05:21:55 Z","content":"In October 2024, <a href=\"https://x.com/troyhunt/status/1850043298049888760\" target=\"_blank\" rel=\"noopener\">The Club Penguin Experience (TCPE) suffered a data breach</a>. The incident exposed over 6k subscribers' email addresses alongside u [...]","contentSnippet":"In October 2024, The Club Penguin Experience (TCPE) suffered a data breach. The incident exposed over 6k subscribers' email addresses alongside usernames, age groups, passwords stored as bcrypt hashes and in some cases, plain text password hints. TCPE sent prompt disclosure notices to impacted customers following the breach.","guid":"TheClubPenguinExperience","isoDate":"2024-10-26T05:21:55.000Z","tag":"hackcidents"}]}